[
  {
    "id": "voucher-management-system",
    "title": "Full-Stack Voucher Management System with Stripe Integration",
    "short_description": "Developed a comprehensive voucher management platform with a React admin dashboard, Node.js backend, and integrated Stripe payments to automate sales and distribution.",
    "problem_statement": "The client required a centralized system to create, manage, sell, and track digital vouchers for their business. They needed a secure way for administrators to manage inventory, including bulk uploads, and a seamless, automated payment process for customers to purchase and receive vouchers.",
    "solution_delivered": "I engineered a full-stack solution featuring a React-based admin dashboard and a secure Node.js/Express.js backend with a MongoDB database. The system provides complete CRUD functionality for vouchers, secure admin authentication using JWT, and role-based access control. Key features include bulk voucher import via CSV and a customizable payment page. The project was delivered in two phases: first, the core management dashboard, and second, a full integration with the Stripe API to handle payment intents and automate the voucher dispensing process upon successful payment.",
    "key_achievements": [
      "Built a multi-tenant ready system where each admin receives a unique API key to securely dispense vouchers.",
      "Integrated the Stripe API to create a fully automated payment and voucher delivery workflow.",
      "Developed a bulk upload feature, allowing admins to import thousands of vouchers from a CSV file, saving significant manual effort.",
      "Designed and implemented a comprehensive RESTful API with clear documentation for all system functionalities."
    ],
    "technologies": [
      "React.js",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Mongoose",
      "Stripe API",
      "RESTful API",
      "JWT",
      "JavaScript"
    ],
    "client_feedback": {
      "quote": "Hi, I have checked the video, looks good and functional.",
      "client_name": "rumaratetekirua, Food Delivery Service"
    },
    "media": [
      {
        "type": "video",
        "src": "https://res.cloudinary.com/dmiqkr7ja/video/upload/v1756670270/Freelance/bandicam_2024-08-09_02-38-45-377_y2g6zk.mp4",
        "caption": "Demo video showcasing the complete voucher management system and Stripe payment flow."
      }
    ]
  },
  {
    "id": "computer-vision-measurement",
    "title": "Automated Object Dimension Measurement using OpenCV",
    "short_description": "Developed a Python script using OpenCV to automatically detect cardboard objects in a video and measure their dimensions (length, width) and distance from a reference point in millimeters.",
    "problem_statement": "The client needed an automated method to accurately measure the physical dimensions of multiple cardboard objects shown in a video. Manual measurement was impractical and time-consuming. The required measurements included the length, width, and distance of each object from the video's starting point.",
    "solution_delivered": "I created a custom Python script leveraging the OpenCV library for computer vision tasks. The script processes the input video, identifies object contours using image processing techniques, and calculates the bounding box for each detected cardboard object. By using a known reference object for scale calibration, the script accurately converts pixel measurements into millimeters, providing the precise length, width, and positional data for each object as requested.",
    "key_achievements": [
      "Achieved high-precision measurements by implementing a robust calibration and object detection algorithm.",
      "Delivered a complete solution, including the Python source code and a demonstration video, ahead of schedule.",
      "The solution successfully handled multiple objects within the video frame, measuring each one individually.",
      "Received a 5-star rating and a significant tip for exceeding client expectations in quality and service."
    ],
    "technologies": [
      "Python",
      "OpenCV"
    ],
    "client_feedback": {
      "quote": "Brilliant programmer, completed my vision system project above my expectations and on time also. Qamar kept me updated throughout the process. Highly recommended, 10/10 for quality of work and service.",
      "client_name": "tonyc2000"
    },
    "media": [
      {
        "type": "video",
        "src": "https://res.cloudinary.com/dmiqkr7ja/video/upload/v1756670400/Freelance/bandicam_2024-09-06_04-27-23-399_zbnrws.mp4",
        "caption": "Live demonstration of the Python script analyzing a video to measure object dimensions in real-time."
      }
    ]
  },
  {
    "id": "color-by-numb3r",
    "title": "Color by Numb3r — Full-Stack E-Commerce & Content Platform",
    "short_description": "Architected and deployed a multi-tenant e-commerce and content platform for a creative business, featuring a custom React CMS, automated product syncing, and a robust FastAPI backend.",
    "problem_statement": "The client required a scalable, production-ready platform to sell custom coloring books and digital content. The existing tools were insufficient for managing a growing catalog of products, serving different user roles (Designers vs Customers), and handling high-volume traffic. They needed a system that could automatically sync product data from external marketplaces like Bol.com and provide a seamless, branded experience for users to create and purchase custom designs.",
    "solution_delivered": "I engineered a complete digital ecosystem hosted on a custom Linux VPS. The backend, built with FastAPI and MongoDB (Beanie), features an automated background sync engine that keeps product inventory and reviews up-to-date with Bol.com. The frontend is a complex React 19 SPA with distinct portals for Customers, Designers, and Admins. I implemented a CI/CD pipeline via GitHub Actions for zero-downtime deployments and optimized performance using Nginx and in-memory caching. The result is a robust, high-performance platform that handles real-time customization and e-commerce transactions.",
    "key_achievements": [
      "Launched a production-live platform serving real customers and designers.",
      "Automated product and review synchronization from Bol.com, reducing manual data entry by 100%.",
      "Implemented a comprehensive Role-Based Access Control (RBAC) system to securely manage different user types.",
      "Established a fully automated CI/CD pipeline, enabling rapid and safe iteration.",
      "Optimized site performance and security with Nginx reverse proxy and SSL termination."
    ],
    "technologies": [
      "Python",
      "FastAPI",
      "React 19",
      "MongoDB",
      "Tailwind CSS v4",
      "Nginx",
      "GitHub Actions",
      "ScrapingAnt"
    ],
    "client_feedback": {
      "quote": "Great Work Qamar. Long term partner.",
      "client_name": "Floris, Project Stakeholder"
    },
    "media": [
      {
        "type": "video",
        "src": "https://www.loom.com/share/9d3eb9001e744aa097b26f20e631c52b",
        "caption": "Overview of the Color by Numb3r platform, showcasing the store, designer tools, and admin capabilities."
      }
    ]
  }
]